// Cw№1

// console.log() ის მეშვეობით ჩვენ საიტის კონსოლში გამოგვაქვს კონკრეტული კოდი



// Cw№2



let x = "labubudubai";
let y = "CHOCOLATE";
let z = "               hello                "

// .charAt() - გამოაქვს რა სიმბოლო მდებარეობს კონკრეტულ ინდექსზე

console.log(x.charAt(1));




// .concat() - იგივე კონკატინაცია

console.log(x.concat(y))




// .slice() - იგივე სლაისინგი. პირველი არგუმენტი არის დასაწყილი(საიდან უნდა დაიწყოს ამოჭრა) მეორე კი დასასრული(სადამდე უნდა ამოიჭრას)

console.log(x.slice(0, 6))




// .toUpperCase() - გადაყავს სიმბოლოები დიდ ასოებათ

console.log(x.toUpperCase())




// .toLowerCase() - გადაყავს სიმბოლოები პატარა ასოებათ

console.log(y.toLowerCase())




// .trim() - შლის space - ს ორივე მხრიდან

console.log(z.trim())




// .trimStart() - შლის space - ს თავში

console.log(z.trimStart())




// .trimEnd() - შლის space - ს ბოლოში

console.log(z.trimEnd())




// .repeat() - სტრინგ გამოიტანს კონსოლში იმდენჯერ რამდენჯერაც მივუთითებთ

console.log(x.repeat(4))




// .replace() - ცვლის პირველ შემხვედრ სიმბოლოს/სიმბოლოებს რასაც მივუთითებთ სხვა სიმბოლოზე/სიმბოლოებზე

console.log(x.replace("bu", "ba"))




// .replaceAll() - ცვლის ყველა შემხვედრ სიმბოლოს/სიმბოლოებს რასაც მივუთითებთ სხვა სიმბოლოზე/სიმბოლოებზე

console.log(x.replaceAll("bu", "ba"))




// .split() - ამ ფუნქციის მეშვეობით სტრინგი იყოფა იმ ნაწილებში რომლებშიც მივუთითებთ და წარმოიქმნება array() (მასივი)

console.log(x.split(""))




// .startsWith() - ამოწმებს თუ სტრინგი იწყება იმ სიმბოლოთი რასაც მივუთითებთ არგუმებტად

console.log(x.startsWith("l"))




// .endsWith() - ამოწმებს თუ სტრინგი მთავრდება იმ სიმბოლოთი რასაც მივუთითებთ არგუმებტად

console.log(x.endsWith("e"))








// Cw№3

// Math.round() - ამრგვალებს რიცხვს ერთეულებამდე

console.log(Math.round(2.12312312312398126308123781294923848203895638912561238))




// Math.ceil() - ამრგვალებს რიცხვს უახლოვეს მაღალ რიცხვამდე

console.log(Math.ceil(2.000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001))




// Math.floor() - ამრგვალებს რიცხვს უახლოვეს დაბალ რიცხვამდე

console.log(Math.floor(2.999999999999999))




// Math.trunc() - აბრუნებს რიცხვის ინტეჯერის ნაწილს

console.log(Math.trunc(2.999999999999999))




// Math.sign() - აბრუნებს -1 - ს თუ რიცხვი უარყოფითია, 1-ს თუ დადებითია და 0-ს თუ 0-ია

console.log(Math.sign(21312))
console.log(Math.sign(-767))
console.log(Math.sign(0))




// Math.pow() - აბრუნებს რიცხვს მეორე რიცხვის ხარისხში

console.log(Math.pow(100,100))




// Math.sqrt() - აბრუნებს რიცხვის კვადრატულ ფესვს

console.log(Math.sqrt(25))




// Math.min() - აბრუნებს რიცხვების მასივიდან მინიმალურს

console.log(Math.min(1,2,3,-1,132123123123))




// Math.max() - აბრუნებს რიცხვების მასივიდან მაქსიმალურს

console.log(Math.max(1,2,3,-1,132123123123))