
#list - არის ერთ-ერთი კოლექციის ტიპი სადაც შეგვიძლია შევინახოთ ყველანაირი ტიპის მონაცემი
# names = ["Giorgi", "Lizi", "Anano", "Dato"] - ლისტი იწერება კვადრატული ბრჩხილებით

#tuple - არის ერთ-ერთი კოლექციის ტიპი სადაც შეგვიძლია შევინახოთ ყველანაირი ტიპის მონაცემი ოგონდ 
#ლისტისგან განსხვავებით ის არის immutable ანუ როცა შევქმნით მისი შეცვლა აგარ შეგვიძლია

 #names = ("Giorgi", "Lizi", "Anano", "Dato") - თაფლი იწერება ჩვეულებრივი ბრჩხილებით


#set - არის ერთ-ერთი კოლექციის ტიპი სადაც შეგვიძლია შევინახოთ ყველანაირი ტიპის მონაცემი და 
#      არ გააჩნია ინდექსები და მასში 2 ან მეტი ერთნაირი მონაცემი ვერ ჩაიწერება
# names = {"Giorgi", "Lizi", "Anano", "Dato"} - სეტი იწერება ჩვეულებრივი ბრჩხილებით

#dictionary - არის ერთ-ერთი კოლექციის ტიპი სადაც მონაცემები ინახება key:value ტიპით. ინდექსების მაგივრად ვიყენებთ key-ს
# names = {  - სეტი იწერება ჩვეულებრივი ბრჩხილებით
#     "name1":"Giorgi",
#     "name2": "Nika",
#     "names": ["Giorgi","Nika"]
# }



# a = True         
# b = False
#                a and b      output: False
#                a or b       output: True
# a = False
# b = True

#------------------------------------------

# a = True        a and b      output: True
# b = True        a or b       output: True

#------------------------------------------

# a = False       a and b      output: False
# b = False       a or b       output: False


#for loop-ს ვიყენებთ როდესაც ვიცით კონნკრეტულად რამდენჯერ უნდა გავიმეოროთ რამე კოდი
#while loop-ს ვიყენებთ როდესაც არ ვიცით რამდენჯერ უნდა გავიმეოროთ კოდი


# მკაცრი შედარების ოპერატორები:         True        False
# > - მეტია -->                         5 > 1        4 > 9  
# < - ნაკლებია -->                      3 < 4        3 < 2

# მკაცრი შედარების ოპერატორები:          True         False
# >= - მეტია ან ტოლია -->               5 >= 5        4 >= 9  
# <= - ნაკლებია ან ტოლია -->            3 <= 3        3 <= 2

# ტოლია/არ არის ტოლი:               True        False
# == - ტოლია                         5 == 5      3 == 4
# != - არ არის ტოლი                  4 != 5      3 != 3